---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurtaingridOriginVert
source: html/ad0ce6c1-3c85-7d72-9b0c-918b97593ee6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurtaingridOriginVert Property

"Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId CurtaingridOriginVert { get; }
```